"""まだ配置場所が決まっていないもの"""

class phipu作成経緯:
    """
        このリポジトリでやりたいことは、
        「システムを分解し、コード化し、明確化し、改善する」
        ということである。

        理由は、自分の思考に自身を持ちたいから　である。

        数年前社会人になったときからずっと自信がない。
        他者との感性の違いは子供の頃から自覚する部分は多かったが、
        大学時代に授業に出席できなくなったときから、自分の考えに自身を持てなくなり、
        自分は頭がおかしいのだと、心の奥底で思う様になった。

        自分と他人の考えが異なっているとき、いつも、
        ・自分の頭がおかしいのだから、他人の言うことが正解なはずだ
        ・しかし、自分だけが気づいていて、他人はみんな気づいていないのではないか
        という矛盾した思考に陥る。これを頻繁に繰り返すことは、私にとって非常に大きなストレスである。

        プログラミングに出会ったとき、
        自分の頭の中や世の中の仕組みを、すっきりわかるようになれると期待したが、
        IT企業に入社して行ってきた作業は、
        「コードを組んでシステムを構築、運用する仕事」であり、常になにか違うと感じていた。

        なにか違う　という感覚を言語化することができずに過ごしてきたが、
        2020年末ころ、逆ではないかという考えに至った。
        「コードを組んでシステムを構築する」のではなく、
        「すでに世の中にあるシステムを分解し、コード化し、明確化し、改善の糸口を探す」
        これが私のやりたいことだったのではないかと思うようになった。

        ただの思い違いではないかと、まだまだ不安だが、
        やってみて、意味のあるものかどうかを確かめたい　という気持ちがある。
        （未コード化）
    """
